Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/hours_of_work/index.html.txt.tmx
Source language: en
Languages: ga

source: The maximum working hours for most employees are set out in the Organisation of Working Time Act 1997
ga: Tá na huaireanta uasta oibre le haghaidh formhór fostaithe leagtha síos san Acht um Eagrú Ama Oibre, 1997

source: Rest periods and breaks
ga: Tréimhsí sosa agus sosanna

source: Employees are entitled to breaks during work and rest between periods of working time
ga: Tá fostaithe i dteideal sosanna le linn oibre agus sos idir tréimhse oibre

source: Describes how the hours of work and the health and safety of night workers are regulated
ga: Míníonn sé an chaoi a rialaítear uaireanta oíche agus sláinte agus sábháilteacht oibrithe oíche

source: This document describes employers' legal duty to keep detailed records of employees' starting and finishing times, the number of hours worked by employees and any leave taken by employees
ga: Cuireann an doiciméad seo síos ar na dualgais dhlithiúla ar fhostóirí taifid mhionsonraithe a choinneáil ar an am a dtosáionn agus a gcríochnaíonn fostaithe, na huaireanta a oibríonn na fostaithe agus aon scor a thóagann siad

source: Most Read in "Employment"
ga: Ábhar is mó éilimh i "Fostaíocht"

source: Tax and starting work - PAYE
ga: Gnó a chur ar bun
